Revit 2027 API
StructuralSectionGeneralU.GetFlangeThicknessInWidthCenter Method
 Returns thickness of flange measured in the 0.5 * width, sometimes used for sections with width <= 300 mm.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFlangeThicknessInWidthCenter()
Public Function GetFlangeThicknessInWidthCenter As Double
public:
double GetFlangeThicknessInWidthCenter()
member GetFlangeThicknessInWidthCenter : unit -> float
Return Value
Double
See Also
Reference
StructuralSectionGeneralU Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace